#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=abf44b0b-5b22-49b7-a2e0-41d4dca39373]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad2d066f-0af2-4dad-b954-e5fe318f905c]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b16b3b13-ff2f-4284-a4d1-1e85fc039180]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=30f052ff-74d6-4cd4-a443-32c5653733bd]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b155a4b-3ff5-44ac-9ee6-ac3cf355df70]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3a89d798-7402-41de-9187-bd5846acbc43]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c42ffd87-3e0a-4530-9949-d9755d34ab84]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bcb39359-cbec-448b-9152-39c873d7e02f]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=98f7b486-3ddd-4e63-94b3-9cc5b88e6129]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ba29669-a2be-43c4-9e73-13c9b066ff39]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80124ac5-0cfb-4bdc-bb8c-bb064be97d64]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6a7af59a-11e1-428c-b95b-a003240adc81]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=362d976c-2820-4f0f-a373-c520c3478342]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bcee6b9e-fc99-436e-943e-69858a9502cd]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=583ff0c9-2c2e-4ab8-bd30-0478b5bfda23]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7c13561-3d76-4df9-8cde-4818654a47fa]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=583832ff-31c6-44cc-ac45-92a613fbf55b]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=520d73ff-bb76-4f59-b305-5d56736e39b1]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8cc4d661-9d61-49a5-905e-9cba65a85cde]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bdc7949f-5895-4516-b440-b5c8649aee3a]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2c92295f-b617-4a8b-abce-d78f46906de4]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5cfbb915-ad07-4d05-9c51-a4d1ac7380bd]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6e4b0315-ee6d-4107-8a32-afe7afea0c42]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=efae425f-33d2-4ffe-8a45-d92a3735d27a]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a995c8fd-ca58-4f09-a94a-2a41bf54ca79]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=eff1f947-fc80-42ff-962e-7a4f1bf68e7a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06cf956e-4dba-4925-bfea-e4edecf6e7b8]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=14f0d0bc-2ddb-46a0-bf05-a4212c669e90]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=949c4a17-105e-4c9b-ae5a-ed0b82fc294f]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a59326b0-9732-4b5b-8b02-60ff96c52cbd]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8b40abb6-fe38-4299-b604-f02fadc6494d]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f24ddbf9-6e0b-42f4-8289-bf84c1e1a2db]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=840c3579-34b1-4539-bb0b-5c72a2371696]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=819adc6e-8790-440a-b3fa-650bd4d9eed6]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8a6e6a22-5b6d-4641-9130-75e7d56c8e8c]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1192dd1d-933d-4695-9db5-6cb95f68dfa8]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e68683c1-2c8d-42c2-be14-f5d15204efb8]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ac89b75f-42c1-43e8-b0e8-0ebe808ad914]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2c0c29e8-f470-4836-85e1-b8269d4a7001]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5ab6e548-9bbd-4ea7-bd04-c6a47bc2de67]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6e0b83e9-4be3-42da-ba3e-2946bf138126]
module.keycloak_prod.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af38e95a-b7a3-4b5a-b35a-fd9d20ee5cbc]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c19c1445-de42-4e96-8658-14beb557c599]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=491a573e-c393-402a-be09-616c16b164f1]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c24fe36-cf7d-4789-bec8-484065f5265e]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f4aaa909-017b-4186-b7e0-8b3486e23627]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ae279b7-44a4-4cc6-bc29-da303eb14ff3]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c40ba8ac-cbab-4622-a68b-d3273a454ec2]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76da18c1-698a-4cac-98d1-f96e42fea05f]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3c77813e-ea25-4f8d-a414-5f63f856ed9f]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6181de42-66e2-41ad-b616-286163f50ae9]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=be856ddc-ed4a-4595-8434-a49efacde8e4]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9e9649e9-b8f2-485d-af7e-9d917370f3db]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3261971d-61e5-4b60-b633-68cacc7c9956]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a45ac277-2314-437e-92a0-332439d59ec6]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a4ec439f-08a7-40e4-91f3-2cb4c8b768bd]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cd9c1e0e-3526-41ee-a0fc-cf5818359f7d]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b141acd2-a02a-4a41-b483-c14a12700776]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1354f9d6-eda4-4448-83bc-45ba6604539e]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=eab5159a-edd3-4c41-a75c-7d608e9d938b]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0132306d-0089-43e8-a91b-4a15836379df]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f79b9d8b-0ddb-4773-b0d7-eea40f3e9fd7]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3ff985b8-4942-4cd5-b877-4e3ff2915845]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=746eb713-ab30-4974-b7a7-eb0d3d0c856b]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=acac31f3-7524-4515-bfbc-01c8b88b3c10]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d83711fc-4898-431a-abef-f42bdafae807]
module.keycloak_prod.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a124a10-0aab-4db4-ad8e-a027f375b344]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b272d47-bf36-4046-9626-b26cfbb70dd3]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=70b9e7d4-e6fb-407e-9306-50e4b49c0583]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e74c5ab8-83fe-41db-a7fb-e3287177ff21]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=22d2ffc0-450d-4538-a161-cbc18a7070b9]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=feb7c095-fc9f-4eeb-b78f-acc5e18bc299]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3eed2f23-f733-496a-89e2-ef490e888f9c]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=15395e35-9180-4fdd-9187-cd59ec234f35]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=baebbc62-6fcb-4d8c-a096-90c30e9e4508]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b1f0bc5e-7fd8-4bb5-b40f-ac951a36fa21]
module.keycloak_prod.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=44bad374-783b-4082-b719-4fb0baa11833]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=651c2666-d4a2-4bab-a268-18f161e7be13]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=360b0018-e4e9-49cf-9fc3-d31c2d13dc47]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a21f3696-f9a4-4f0d-9e8f-11a758a5f0a4]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7ba2f229-db56-4985-b6cb-34a7d19bc7ff]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bad3adaa-9168-474b-939c-fa76bce5abbd]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=434ce153-1f2c-479a-9815-9599d0789951]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=38930472-2ded-487b-8ac5-433e0dd705be]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83a6c9a7-f80e-4e4d-a32f-6aad6fa5ab2a]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ff88a994-be08-44df-b44e-32af353ea455]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a26e0375-8088-43a3-9631-457c190d3b69]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9344419-c5ef-48b6-8127-d8bac4b52dac]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b2f395d9-c4dc-4af8-a9dc-a034eff0399b]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=397a371a-c3bc-4ef8-9d20-18414214e53e]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dbc177a4-8e42-4161-a701-9af55738d0c1]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=811301f7-6066-49a4-af86-000e2a0635b6]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4d8b0ab9-6735-4909-b42e-495a6735d79e]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=433c6050-f9af-4d52-9d8d-d4cc22370459]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3d52de61-504c-4dad-9040-9b18488d3a83]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6be1ff59-fbb1-413c-8ba7-0dc82d0a8f09]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d93bee8-51bc-4628-9bd6-28c86223b758]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=532e882f-23e3-4b1f-b623-87da219e84a5]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=17c09713-1067-439c-8d76-eda0a92b4cbb]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a71a96c9-512b-4ffe-998b-4118884e2afd]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a5b7488-e47c-40cc-9270-3a7cb6c98740]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zorin-test-jan-4-teams-take-2-4291"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zorin-test-jan-4-teams-take-2-4291"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "zorin-test-jan-4-teams-take-2-4291"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zorin-test-jan-4-teams-take-2-4291"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.test.ca/devChanged",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zorin-test-jan-4-teams-take-2-4291"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zorin-test-jan-4-teams-take-2-4291"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_zorin-test-jan-4-teams-take-2-4291.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "zorin-test-jan-4-teams-take-2-4291"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zorin-test-jan-4-teams-take-2-4291"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.test.ca/testCHANGED",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3357 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*